In [18]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns
%matplotlib inline

## Import Dataset

In [19]:
df= pd.read_csv('data_balita.csv')

In [20]:
df.head()

   Umur (bulan) Jenis Kelamin  Tinggi Badan (cm)       Status Gizi
0             0     laki-laki          44.591973           stunted
1             0     laki-laki          56.705203            tinggi
2             0     laki-laki          46.863358            normal
3             0     laki-laki          47.508026            normal
4             0     laki-laki          42.743494  severely stunted

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120999 entries, 0 to 120998
Data columns (total 4 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Umur (bulan)       120999 non-null  int64
 1   Jenis Kelamin      120999 non-null  object
 2   Tinggi Badan (cm)  120999 non-null  float64
 3   Status Gizi        120999 non-null  object
dtypes: float64(1), int64(1), object(2)
memory usage: 3.7+ MB

In [22]:
df.describe()

        Umur (bulan)  Tinggi Badan (cm)
count  120999.000000      120999.000000
mean       30.173803          88.655434
std        17.575119          17.300997
min         0.000000          40.010437
25%        15.000000          77.000000
50%        30.000000          89.800000
75%        45.000000         101.200000
max        60.000000         128.000000

In [23]:
df['Jenis Kelamin'].unique()

array(['laki-laki', 'perempuan'], dtype=object)

In [24]:
df['Status Gizi'].unique()

array(['stunted', 'tinggi', 'normal', 'severely stunted'], dtype=object)

In [25]:
df.isnull().sum()

Umur (bulan)         0
Jenis Kelamin        0
Tinggi Badan (cm)    0
Status Gizi          0
dtype: int64

In [26]:
df.duplicated().sum()

81574

In [27]:
df.isna().sum()

Umur (bulan)         0
Jenis Kelamin        0
Tinggi Badan (cm)    0
Status Gizi          0
dtype: int64

## Exploratory Data Analysis

In [28]:
df.columns

Index(['Umur (bulan)', 'Jenis Kelamin', 'Tinggi Badan (cm)', 'Status Gizi'], dtype='object')

In [29]:
df = df.rename(columns = {'Umur (bulan)' : 'age(month)',
                     'Jenis Kelamin' : 'sex',
                     'Tinggi Badan (cm)' : 'height(cm)',
                    'Status Gizi' : 'status'})

In [30]:
df.nunique()

age(month)      61
sex              2
height(cm)    6800
status           4
dtype: int64

In [31]:
df['sex'] = df['sex'].replace({'laki-laki' : 'male' ,
                  'perempuan' : 'female'})

In [35]:
df['status'] = df['status'].replace({
    'tinggi' : 'tall',
})

In [56]:
df.groupby(['sex','status']).sum()

                         age(month)  height(cm)
sex    status
female normal                 34352       34352
       severely stunted        9495        9495
       stunted                 7006        7006
       tall                   10149       10149
male   normal                 33403       33403
       severely stunted       10374       10374
       stunted                 6809        6809
       tall                    9411        9411

In [103]:
df[df['jenis_kelamin'].str.contains('perempuan')]

        umur(bulan) jenis_kelamin  tinggi_badan(cm)       status_gizi
997               0     perempuan         42.195784  severely stunted
998               0     perempuan         54.817340            tinggi
999               0     perempuan         43.702108           stunted
1000              0     perempuan         41.400348  severely stunted
1001              0     perempuan         40.748218  severely stunted
...             ...           ...               ...               ...
120994           60     perempuan        100.600000            normal
120995           60     perempuan         98.300000           stunted
120996           60     perempuan        121.300000            normal
120997           60     perempuan        112.200000            normal
120998           60     perempuan        109.800000            normal

[61002 rows x 4 columns]

In [87]:
df.groupby(['jenis_kelamin','status_gizi']).size().reset_index(name='counts')

  jenis_kelamin       status_gizi  counts
0     laki-laki            normal   33403
1     laki-laki  severely stunted   10374
2     laki-laki           stunted    6809
3     laki-laki            tinggi    9411
4     perempuan            normal   34352
5     perempuan  severely stunted    9495
6     perempuan           stunted    7006
7     perempuan            tinggi   10149

In [73]:
df.groupby('status_gizi')[['tinggi_badan(cm)','umur(bulan)']].mean()

                  tinggi_badan(cm)  umur(bulan)
status_gizi
normal                   92.702689    32.607601
severely stunted         73.176224    26.290956
stunted                  82.208722    32.763807
tinggi                   94.912898    23.858129

In [80]:
df.status_gizi.value_counts()

status_gizi
normal              67755
severely stunted    19869
tinggi              19560
stunted             13815
Name: count, dtype: int64

In [128]:
df.jenis_kelamin.value_counts()

jenis_kelamin
perempuan    61002
laki-laki    59997
Name: count, dtype: int64

In [97]:
df.groupby(['jenis_kelamin','status_gizi']).size()

jenis_kelamin  status_gizi
laki-laki      normal              33403
               severely stunted    10374
               stunted              6809
               tinggi               9411
perempuan      normal              34352
               severely stunted     9495
               stunted              7006
               tinggi              10149
dtype: int64

In [145]:
df_2 = df[(df['jenis_kelamin'] == 'laki-laki') & (df['status_gizi'] == 'stunted')]
df_2.shape[0]

6809

In [171]:
df[df['status_gizi'] == 'stunted'].groupby('jenis_kelamin').count()

               umur(bulan)  tinggi_badan(cm)  status_gizi
jenis_kelamin
laki-laki             6809              6809         6809
perempuan             7006              7006         7006

In [13]:
df['sex'].unique()

array(['laki-laki', 'perempuan'], dtype=object)

In [17]:
df.head()

0    male
1    male
2    male
3    male
4    male
Name: sex, dtype: object

In [33]:
df['status'].unique()

array(['stunted', 'tinggi', 'normal', 'severely stunted'], dtype=object)